import 'package:shared_preferences/shared_preferences.dart';

const List<String> predefinedFoodList = [
  "갈비구이", "갈치구이", "고등어구이", "곱창구이", "닭갈비",
  "더덕구이", "떡갈비", "불고기", "삼겹살", "장어구이",
  "조개구이", "조기구이", "황태구이", "훈제오리", "계란국",
  "떡국", "무국", "미역국", "북어국", "시래기국",
  "육개장", "콩나물국", "과메기", "양념치킨", "젓갈",
  "콩자반", "편육", "피자", "후라이드치킨", "갓김치",
  "깍두기", "나박김치", "무생채", "배추김치", "백김치",
  "부추김치", "열무김치", "오이소박이", "총각김치", "파김치",
  "가지볶음", "고사리나물", "미역줄기볶음", "숙주나물", "시금치나물",
  "애호박볶음", "경단", "꿀떡", "송편", "만두",
  "라면", "막국수", "물냉면", "비빔냉면", "수제비",
  "열무국수", "잔치국수", "짜장면", "짬뽕", "쫄면",
  "칼국수", "콩국수", "꽈리고추무침", "도라지무침", "도토리묵",
  "잡채", "콩나물무침", "홍어무침", "회무침", "김밥",
  "김치볶음밥", "누룽지", "비빔밥", "새우볶음밥", "알밥",
  "유부초밥", "잡곡밥", "주먹밥", "감자채볶음",
  "건새우볶음", "고추장진미채볶음", "두부김치", "떡볶이",
  "라볶이", "멸치볶음", "소시지볶음", "어묵볶음",
  "오징어채볶음", "제육볶음", "쭈꾸미볶음", "보쌈",
  "수정과", "식혜", "간장게장", "양념게장",
  "깻잎장아찌", "떡꼬치", "감자전", "계란말이", "계란후라이",
  "김치전", "동그랑땡", "생선전", "파전", "호박전",
  "곱창전골", "갈치조림", "감자조림", "고등어조림",
  "꽁치조림", "두부조림", "땅콩조림", "메추리알장조림",
  "연근조림", "우엉조림", "장조림", "코다리조림",
  "전복죽", "호박죽", "김치찌개", "닭개장",
  "동태찌개", "된장찌개", "순두부찌개", "갈비찜",
  "계란찜", "김치찜", "꼬막찜", "닭볶음탕",
  "수육", "순대", "족발", "찜닭", "해물찜",
  "갈비탕", "감자탕", "곰탕", "매운탕",
  "삼계탕", "추어탕", "고추튀김", "새우튀김",
  "오징어튀김", "약과", "약식", "한과",
  "멍게", "산낙지", "물회", "육회"
];

/// 음식 리스트를 로컬 저장소(SharedPreferences)에 저장하는 함수
Future<void> saveFoodList() async {
  final prefs = await SharedPreferences.getInstance();
  await prefs.setStringList('food_list', predefinedFoodList);
}

Future<List<String>> loadFoodList() async {
  final prefs = await SharedPreferences.getInstance();
  return prefs.getStringList('food_list') ?? predefinedFoodList;
}
