/// 평균 하루 영양소 권장 섭취량 (단위: g, mg, μg)
const Map<String, double> averageDailyRequirements = {
  "탄수화물": 300.0, // g
  "단백질": 100.0, // g
  "지방": 70.0, // g
  "식이섬유": 30.0, // g
  "비타민 A": 800.0, // μg
  "비타민 B1": 1.2, // mg
  "비타민 B2": 1.3, // mg
  "비타민 B3": 16.0, // mg
  "비타민 B6": 1.7, // mg
  "비타민 B12": 2.4, // μg
  "엽산": 400.0, // μg
  "비타민 C": 90.0, // mg
  "비타민 D": 20.0, // μg
  "비타민 E": 15.0, // mg
  "비타민 K": 120.0, // μg
  "칼슘": 1000.0, // mg
  "철분": 18.0, // mg
  "마그네슘": 400.0, // mg
  "나트륨": 1500.0, // mg
  "칼륨": 3500.0, // mg
  "아연": 11.0, // mg
  "인": 700.0, // mg
  "오메가-3": 1.6, // g
};
